In [277]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

default_dict = {'A': [0, 0, 1, 1, 2, 2],
                'B': [0, 1, 2, 3, 4, 5],
                'C': ['a', 'b', 'c', 'd', 'e', 'f']}

df = pd.DataFrame(default_dict)
s = pd.Series([0, 1, 2, 3, 4])

In [278]:
df

   A  B  C
0  0  0  a
1  0  1  b
2  1  2  c
3  1  3  d
4  2  4  e
5  2  5  f

#### Replace a value in a column.

In [124]:
df['A'] = df['A'].replace(1, 100)

df

     A  B  C
0    0  0  a
1    0  1  b
2  100  2  c
3  100  3  d
4    2  4  e
5    2  5  f

In [125]:
# hide
df = pd.DataFrame(default_dict)

#### Replace multiple values in a column.

In [126]:
df['A'] = df['A'].replace([0,2], 999)
df

     A  B  C
0  999  0  a
1  999  1  b
2    1  2  c
3    1  3  d
4  999  4  e
5  999  5  f

In [127]:
# hide
df = pd.DataFrame(default_dict)

#### Replace a value in specific columns.

In [128]:
df.replace({"A":1,"B":2}, 999)

     A    B  C
0    0    0  a
1    0    1  b
2  999  999  c
3  999    3  d
4    2    4  e
5    2    5  f

#### Replace multiple values in specific columns.

In [129]:
df.replace({"A":[1,2],"B":[2,3]}, 999)

     A    B  C
0    0    0  a
1    0    1  b
2  999  999  c
3  999  999  d
4  999    4  e
5  999    5  f

#### Replace a value in all columns.

In [130]:
df.replace(1, 100)

     A    B  C
0    0    0  a
1    0  100  b
2  100    2  c
3  100    3  d
4    2    4  e
5    2    5  f

In [245]:
df = pd.DataFrame(default_dict)

## Regular Expression

*Convert `DataFrame` data type to `str`.*

In [247]:
df = df.astype('str')

Replace values using regular expression.

In [256]:
df.replace(r'^(b)$', 'new', regex=True)

   A  B    C
0  0  0    a
1  0  1  new
2  1  2    c
3  1  3    d
4  2  4    e
5  2  5    f

Replace in a specific column using regular expression.

In [257]:
df.replace({'A': r'^(1)$'}, {'A': r'\1_new'}, regex=True)

       A  B  C
0      0  0  a
1      0  1  b
2  1_new  2  c
3  1_new  3  d
4      2  4  e
5      2  5  f

#### Replace values in multiple columns with regex.

In [260]:
df.replace({'A': r'^(1)$', 'B': r'^(2)$'}, r'\1_new', regex=True)

       A      B  C
0      0      0  a
1      0      1  b
2  1_new  2_new  c
3  1_new      3  d
4      2      4  e
5      2      5  f

Take a function as replacement value.

In [275]:
nums = {'0': '-',
        '1': 'one',
        '2': 'two',
        '3': 'three',
        '4': 'four',
        '5': 'five'}

def repl(m):
    #return m.group()
    return nums[m.group()]

df['B'] = df['B'].str.replace(r"^([0-9])$", repl, regex=True)
df

   A      B  C
0  0      -  a
1  0    one  b
2  1    two  c
3  1  three  d
4  2   four  e
5  2   five  f

#### Fill

Forward or backward fill replacement values.

#### Use ffill to replace values with the value above them in a column.
*0 is not replace in column A as there is not a valid value above the value.*

In [132]:
df.replace([0, 2], method='ffill')

   A  B  C
0  0  0  a
1  0  1  b
2  1  1  c
3  1  3  d
4  1  4  e
5  1  5  f

#### Use bfill to replace values with the value below them in a column.

*2 is not replace in column A as there is not a valid value below the value.*

In [133]:
df.replace([0, 2], method='bfill')

   A  B  C
0  1  1  a
1  1  1  b
2  1  3  c
3  1  3  d
4  2  4  e
5  2  5  f

#### Replace values where the condition is True with the value in another column.

In [280]:
# hide
df = pd.DataFrame(default_dict)

#### Replace values that meet a condition with the values in another column.

In [281]:
df['A'].mask(df['A'] == 1, df['B'], axis=0, inplace=True)
df

   A  B  C
0  0  0  a
1  0  1  b
2  2  2  c
3  3  3  d
4  2  4  e
5  2  5  f

In [213]:
# hide
df = pd.DataFrame(default_dict)

#### Replace values that meet a condition with a function value.

In [210]:
df['A'].mask(lambda x: x > 1, lambda x: x + 10, inplace=True)
df

    A  B  C
0   0  0  a
1   0  1  b
2   1  2  c
3   1  3  d
4  12  4  e
5  12  5  f